app/controllers/layerable_controller.rb

  def get_all
    array = Array.new
    Layerable.find_each do |layerable|
---
SELECT * FROM `layerables` WHERE (layerables.id >= 0) ORDER BY layerables.id ASC LIMIT 1000