app/controllers/store_controller.rb

SELECT * FROM `stores` WHERE (stores.id >= 0) ORDER BY stores.id ASC LIMIT 1000
---
  def find_by_parent_id
    array = Array.new
    Store.find_each(:conditions => ["game_id = ?", params[:game_id]]) do |store|