app/controllers/structure_controller.rb

SELECT * FROM `structures` WHERE (structures.id >= 0) ORDER BY structures.id ASC LIMIT 1000
---
  def get_all
    array = Array.new
    Structure.find_each do |structure|