app/controllers/user_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def find_by_id
    array = Array.new
    hash = Hash.new
    user = User.find(params[:id])